Repository: StatCan/gensol-banff
Catalog: Python/src/banff/nls/messages/*/LC_MESSAGES/banff.po
Languages: fr

source: Importing Banff package version {}
fr: Importation de la version {} du package Banff

source: Banff package imported
fr: Paquet Banff importé

source: TEST MESSAGE for Native Language Support: Forest, naive, French, Creme Brulee
fr: MESSAGE DE TEST pour la prise en charge de la langue maternelle: forêt, naïf, français, crème brûlée

source: Configuring procedure-level logging for Banff Processor log redirection
fr: Configuration de la journalisation au niveau des procédures pour la redirection du journal du processeur Banff

source: Internal error: subclass must implement `{}` method
fr: Erreur interne: la sous-classe doit implémenter la méthode `{}`

source: Parameter `{}` cannot contain the substring '{}'
fr: Le paramètre `{}` ne peut pas contenir la sous-chaîne '{}'

source: Ignoring option `{}='{}'` (empty string)
fr: Ignorer l'option `{}='{}'` (chaîne vide)

source: Preprocessing: `exclude_where_indata='{}'`
fr: Prétraitement: `exclude_where_indata='{}'`

source: Preprocessing: `exclude_where_indata_hist='{}'`
fr: Prétraitement: `exclude_where_indata_hist='{}'`

source: Option `{}` is deprecated, use `{}` instead
fr: L'option `{}` est obsolète, utilisez `{}` à la place

source: options `{}` and `{}` cannot be specified together
fr: les options `{}` et `{}` ne peuvent pas être spécifiées ensemble
